app/views/tasks/show.html.erb


<% if @task.users.any? %>
---
SELECT "users".* FROM "users" WHERE "users"."task_id" = ?  [["task_id", 3]]
SELECT  1 AS one FROM "users" WHERE "users"."task_id" = ? LIMIT ?  [["task_id", 5], ["LIMIT", 1]]


  <% @task.users.each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."task_id" = ?  [["task_id", 5]]