app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
SELECT  1 AS one FROM "tasks" WHERE "tasks"."project_id" = ? LIMIT ?  [["project_id", 1], ["LIMIT", 1]]
---

<% if @project.tasks.any? %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
---

<% @project.tasks.each do |task| %>