app/controllers/projects_controller.rb

  def index
    @project = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "summary", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdasd"], ["summary", "asd"], ["start_date", "2018-07-17"], ["end_date", "2018-07-19"], ["created_at", "2018-07-22 04:44:44.956133"], ["updated_at", "2018-07-22 04:44:44.956133"]]

  def update
    @project = Project.find(params[:id])

    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "asdkljl"], ["start_date", "2018-07-02"], ["end_date", "2018-07-02"], ["updated_at", "2018-07-21 17:43:02.313390"], ["id", 1]]