app/controllers/users_controller.rb

  def new
    @task = Task.find(params[:task_id])
    @project = Project.find(params[:project_id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @project = Project.find(params[:project_id])
    @task = Task.find(params[:task_id])
    @user = @task.users.create(user_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "email", "password", "admin", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)